#ifndef FLOW_H
#define FLOW_H

#if defined(__clang__)
#define FLOW_COMPILER_CLANG
#elif defined(_MSC_VER)
#define FLOW_COMPILER_MSVC
#endif

#ifdef FLOW_COMPILER_MSVC
#pragma warning(push)
#pragma warning(disable : 4201 4820 4587)
#endif

#ifdef FLOW_STATIC_DEF
#define FLOWDEF static
#else
#ifdef __cplusplus
#define FLOWDEF extern "C"
#else
#define FLOWDEF extern
#endif
#endif

/* Generate unique names */
#define flow_static_assert_line(condition, line) \
typedef char static_assert_##line[(condition) ? 1 : -1]

#define flow_static_assert(condition) flow_static_assert_line(condition, __LINE__)

#if defined(FLOW_COMPILER_MSVC)
# if defined(__SANITIZE_ADDRESS__)
#  define FLOW_ASAN_ENABLED
#  define FLOW_NO_ASAN __declspec(no_sanitize_address)
# else
#  define FLOW_NO_ASAN
# endif
#elif defined(FLOW_COMPILER_CLANG)
# if defined(__has_feature)
#  if __has_feature(address_sanitizer) || defined(__SANITIZE_ADDRESS__)
#   define FLOW_ASAN_ENABLED
#  endif
# endif
# define FLOW_NO_ASAN __attribute__((no_sanitize("address")))
#else
# define FLOW_NO_ASAN
#endif

#ifdef FLOW_ASAN_ENABLED
#ifndef Flow_Asan_Poison_Memory_Region
#pragma comment(lib, "clang_rt.asan_dynamic-x86_64.lib")
void __asan_poison_memory_region(void const volatile *addr, size_t size);
void __asan_unpoison_memory_region(void const volatile *addr, size_t size);
#define Flow_Asan_Poison_Memory_Region(addr, size)   __asan_poison_memory_region((addr), (size))
#define Flow_Asan_Unpoison_Memory_Region(addr, size) __asan_unpoison_memory_region((addr), (size))
#endif
#else
#define Flow_Asan_Poison_Memory_Region(addr, size)   ((void)(addr), (void)(size))
#define Flow_Asan_Unpoison_Memory_Region(addr, size) ((void)(addr), (void)(size))
#endif

#include <stdint.h>

typedef int8_t  flow_s8;
typedef int16_t flow_s16;
typedef int32_t flow_s32;
typedef int64_t flow_s64;

typedef uint8_t  flow_u8;
typedef uint16_t flow_u16;
typedef uint32_t flow_u32;
typedef uint64_t flow_u64;

typedef float flow_f32;
typedef double flow_f64;

typedef flow_s8 flow_bool8;
typedef flow_s32 flow_bool;

#define flow_false 0
#define flow_true 1

#ifdef FLOW_USE_F64
typedef flow_f64 flow_real;
#else
typedef flow_f32 flow_real;
#endif

flow_static_assert(sizeof(flow_s8)  == 1);
flow_static_assert(sizeof(flow_s16) == 2);
flow_static_assert(sizeof(flow_s32) == 4);
flow_static_assert(sizeof(flow_s64) == 8);

flow_static_assert(sizeof(flow_u8)  == 1);
flow_static_assert(sizeof(flow_u16) == 2);
flow_static_assert(sizeof(flow_u32) == 4);
flow_static_assert(sizeof(flow_u64) == 8);

flow_static_assert(sizeof(flow_f32) == 4);
flow_static_assert(sizeof(flow_f64) == 8);

typedef struct flow_v3 flow_v3;

struct flow_v3 {
	union {
		flow_real Data[3];
		struct {
			flow_real x, y, z;
		};
	};

#ifdef __cplusplus
	flow_v3() : x(0), y(0), z(0) {}
	flow_v3(flow_real X, flow_real Y, flow_real Z) : x(X), y(Y), z(Z) {}
#ifdef FLOW_VEC3_CLASS_EXTRA
	FLOW_VEC3_CLASS_EXTRA
#endif
#endif
};

typedef struct flow_quat flow_quat;
struct flow_quat {
	union {
		flow_real Data[4];
		struct { flow_v3 v; flow_real s; };
		struct { flow_real x, y, z, w; };
	};

#ifdef __cplusplus
	flow_quat() : x(0), y(0), z(0), w(0) {}
	flow_quat(flow_real X, flow_real Y, flow_real Z, flow_real W) : x(X), y(Y), z(Z), w(W) {}
#ifdef FLOW_QUAT_CLASS_EXTRA
	FLOW_QUAT_CLASS_EXTRA
#endif
#endif
};

typedef void* flow_allocate_memory_func(size_t Size, void* UserData);
typedef void  flow_free_memory_func(void* Memory, void* UserData);
typedef struct {
	flow_allocate_memory_func* AllocateMemory;
	flow_free_memory_func* 	   FreeMemory;
	void* 				  	   UserData;
